public/Tipos/HoTT/Rijke/dependiente.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-21 Sun 07:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Teoría de tipos dependientes</title>
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='/style.css' />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
        <div class="navbar-brand">
            <a href="/index.html">🏠 Home</a>
        </div>
        <div class="navbar-menu">
                <div class="navbar-item dropdown">
                        <a href="#" class="dropbtn">🖥️ Computación</a>
                        <div class="dropdown-content">
                                <a href="/Computacion/index.html">📋 Resumen</a>
                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">⚙️ Algoritmos</a>
                                        <div class="submenu-content">
                                                <a href="/Computacion/Algoritmos/index.html">📋 Resumen</a>
                                                <a href="/Computacion/Algoritmos/pensamiento.html">🧠 Pensamiento algorítmico</a>
                                        </div>
                                </div>
                        </div>
                </div>
                <div class="navbar-item dropdown">
                        <a href="#" class="dropbtn">🤖 AI</a>
                        <div class="dropdown-content">
                                <a href="/AI/index.html">📋 Resumen</a>
                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">📚 CS229</a>
                                        <div class="submenu-content">
                                                <a href="/AI/CS229/index.html">📋 Resumen</a>
                                                <a href="/AI/CS229/AprendizajeSupervisado/aprendizaje_supervisado.html">🎯 Aprendizaje Supervisado</a>
                                                <a href="/AI/CS229/AprendizajeSupervisado/regresion_lineal.html">📈 Regresión Lineal</a>
                                        </div>
                                </div>
                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">🏗️ DataCamp</a>
                                        <div class="submenu-content">
                                                <a href="/AI/DataCamp/index.html">📋 Resumen</a>
                                                <a href="/AI/DataCamp/desglosando_el_transformer.html">🔍 Desglosando el Transformer</a>
                                                <a href="/AI/DataCamp/embedding_y_codificacion_posicional.html">🔗 Embedding y Codificación Posicional</a>
                                        </div>
                                </div>
                        </div>
                </div>
                <div class="navbar-item dropdown">
                        <a href="#" class="dropbtn">🔤 Tipos</a>
                        <div class="dropdown-content">

                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">✍️ Pruebas y tipos</a>
                                        <div class="submenu-content">
                                                <a href="/Tipos/ProofsAndTypes/index.html">📋 Resumen </a>
                                                <a href="/Tipos/ProofsAndTypes/sentido.html">🧠 Sentido, denotación y semántica</a>
                                        </div>
                                </div>

                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">🔬 HoTT</a>
                                        <div class="submenu-content">
                                                <div class="dropdown-submenu">
                                                        <a href="#" class="submenu-btn">🔬 HoTT (Carnegie Mellon)</a>
                                                        <div class="submenu-content">
                                                                <a href="/HoTT/index.html">📋 Resumen</a>
                                                                <a href="/HoTT/introduccion.html">🚀 Introducción</a>
                                                                <a href="/HoTT/juicios.html">⚖️ Juicios</a>
                                                                <a href="/HoTT/transitividad.html">🔛 Transitividad </a>
                                                                <a href="/HoTT/exponenciales.html">🗼 Exponenciales</a>
                                                                <a href="/HoTT/igualdad.html">🟰 Igualdad</a>
                                                        </div>
                                                </div>

                                                <div class="dropdown-submenu">
                                                        <a href="#" class="submenu-btn">🔬 Introducción a HoTT (Rijke)</a>
                                                        <div class="submenu-content">
                                                                <a href="/Tipos/Rijke/index.html">📋 Resumen </a>
                                                        </div>
                                                </div>
                                        </div>
                                </div>

                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">🖥️ Lean</a>
                                        <div class="submenu-content">
                                                <a href="/Tipos/Lean/index.html">📋 Resumen </a>
                                        </div>
                                </div>
                        </div>
                </div>
        </div>
  </nav>
</div>
<div id="content" class="content">
<h1 class="title">Teoría de tipos dependientes</h1>
<p>
La teoría de tipos dependiente es un sistema de reglas que se puede combinar para crear <b>derivaciones</b>. En
estas derivaciones, la meta es frecuentemente construir un elemento de un cierto tipo. Un elemento así puede
ser una función si el tipo del elemento a construir es un tipo función, una demostración de una propiedad
si el tipo del elemento a construir es una proposición, pero también puede ser una identificación si el tipo
del elemento a construir es un tipo identidad, etc. En cierto respecto, un tipo es sólo una colección de
objetos matemáticos y la construcción de elementos de un cierto tipo es la tarea o desafío matemático del
día a día. El sistema de reglas de inferencia al que llamamos teoría de tipos nos da una forma de
participar en esta actividad.
</p>
<div id="outline-container-org11ee69c" class="outline-2">
<h2 id="org11ee69c">Juicios y contextos en la teoría de tipos</h2>
<div class="outline-text-2" id="text-org11ee69c">
<p>
Un argumento matemático o construcción cosiste de una secuencia de pasos deductivos, cada uno con una
cantidad finita de premisas para llegar a la siguiente etapa de la demostración o construcción. Estos
pasos se pueden representar mediante <b>reglas de inferencia</b>, que se escriben de la siguiente forma:
\[
        \frac{\mathcal{H}_1 ~~~ \mathcal{H}_2 ~~~ \ldots ~~~ \mathcal{H}_n}{\mathcal{C}}.
\]
Las reglas de inferencia contienen, arriba de la línea horizontal, una lista finita \(\mathcal{H}_1,
\mathcal{H}_2, \ldots, \mathcal{H}_n\)
de juicios como las <b>premisas</b> y, debajo de la misa línea, un único juicio \(\mathcal{C}\) como la <b>conclusión</b>. El sistema
de la teoría de tipos dependiente es un conjunto de este tipo de reglas de inferencia.
</p>

<p>
Un ejemplo directo de una regla de inferencia con la que nos vamos a encontrar cuando introduzcamos los tipos
función, es la regla de inferencia
\[
        \frac{\Gamma \vdash a: A ~~~ \Gamma \vdash f: A \to B}{\Gamma \vdash f(a): B}.
\]
Esta regla asegura que bajo cualquier contexto \(\Gamma\) podemos usar un elemento \(a: A\) y una función
\(f: A \to B\) para obtener un elemento \(f(a): B\). Cada una de las expresiones
</p>
<ul class="org-ul">
<li>\(\Gamma \vdash a: A\)</li>
<li>\(\Gamma \vdash f: A \to B\)</li>
<li>\(\Gamma \vdash f(a): B\)</li>
</ul>
<p>
son ejemplos de juicios.
</p>
</div>
<div id="outline-container-org178374b" class="outline-3">
<h3 id="org178374b">Definición 1.1.1</h3>
<div class="outline-text-3" id="text-org178374b">
<p>
Hay cuatro tipos de <b>juicios</b> en la teoría de tipos dependiente de Martin-Löf:
</p>
<ol class="org-ol">
<li>\(A\) es un <b>tipo</b> (bien formado) en el contexto \(\Gamma\). Expresamos este juicio como \[ \Gamma \vdash A ~~~ \text{type} \].</li>
<li>\(A\) y \(B\) son <b>tipos juiciosamente iguales</b> en el contexto \(\Gamma\). Expresamos este juicio como
\[ \Gamma \vdash A \stackrel{\cdot}{=} B ~~~ \text{type}\].</li>
<li>\(a\) es un <b>elemento</b> de tipo \(A\) en el contexto \(\Gamma\). Expresamos este juicio como
\[ \Gamma \vdash a: A \].</li>
<li>\(a\) y \(b\) son <b>elementos juiciosamente iguales</b> del tipo \(A\) en el contexto \(\Gamma\). Expresamos este
juicio como \[ \Gamma \vdash a \stackrel{\cdot}{=} b: A \].</li>
</ol>

<p>
Vemos que todos los juicios son de la forma \(\Gamma \vdash \mathcal{J}\), consistiendo de un contexto \(\Gamma\)
y una tesis de juicio \(\mathcal{J}\) que asegura ya sea que \(A\) es un tipo, que \(A\) y \(B\) son tipos
iguales, que \(a\) es un elemento del tipo \(A\) o que \(a\) y \(b\) son elementos iguales del mismo tipo
\(A\). El rol del contexto es declara qué <b>elementos hipotéticos</b> son asumidos, junto con sus tipos.
Los elementos hipotéticos son comúnmente llamados <b>variables</b>.
</p>
</div>
</div>
<div id="outline-container-definicion-1-1-2" class="outline-3">
<h3 id="definicion-1-1-2">Definición 1.1.2</h3>
<div class="outline-text-3" id="text-definicion-1-1-2">
<p>
Un <b>contexto</b> es una lista finita de <b>declaraciones de variables</b>
\[\tag{1.1.1}\label{eq:lista-contexto}
  x_1: A_1, x_2: A_2(x_1), \ldots, x_n: A_n(x_1, \ldots, x_{n-1})
\]
que satisfacen la condición de que para cada \(1 \leq k \leq n\) podemos derivar el juicio
\[ x_1: A_1, \ldots, x_{k-1}: A_{k-1}(x_1, \ldots, x_{k-2}) \vdash A_k (x_1, \ldots, x_{k-1} ~~~ \text{type})\]
usando las reglas de inferencia de la teoría de tipos. Podemos usar nombres de variables que no sean
\(x_1, \ldots, x_n\) siempre que no declaremos una misma variable más de una vez.
</p>

<p>
La condición de la Definición <a href="#definicion-1-1-2">1.1.2</a> de que cada uno de los elementos hipotéticos tiene asignado un tipo,
es verificado recursivamente. En otras palabras, para verificar que una declaración de variables como
en la ecuación \eqref{eq:lista-contexto} es un contexto, uno empieza por la izquierda y se va
trabajando hacia la derecha, verificando que cada elemento hipotético \(x_k\) tenga un tipo asignado.
</p>

<p>
Notemos que hay un contexto de longitud 0, el <b>contexto vacío</b>, en el que no se declara ninguna variable.
Este contexto satisface la definición <a href="#definicion-1-1-2">1.1.2</a> por vacuidad. Una lista de declaraciones de variables
\(x_1: A_1\) es un contexto si y sólo si \(A_1\) es un tipo en el contexto vacío.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
